grevaillot/svd_tools/headers/STM32F3x4/hrtim_tima.h
#pragma once 

/* --- HRTIM_TIMA: High Resolution Timer: TIMA ---------------------- */

/** @defgroup hrtim_tima_registers High Resolution Timer: TIMA Register
@{*/

/** HRTIM_TIMA_TIMACR Timerx Control Register **/
#define HRTIM_TIMA_TIMACR			MMIO32(HRTIM_TIMA_BASE + 0x00)
/** HRTIM_TIMA_TIMAISR Timerx Interrupt Status Register **/
#define HRTIM_TIMA_TIMAISR			MMIO32(HRTIM_TIMA_BASE + 0x04)
/** HRTIM_TIMA_TIMAICR Timerx Interrupt Clear Register **/
#define HRTIM_TIMA_TIMAICR			MMIO32(HRTIM_TIMA_BASE + 0x08)
/** HRTIM_TIMA_TIMADIER5 TIMxDIER5 **/
#define HRTIM_TIMA_TIMADIER5			MMIO32(HRTIM_TIMA_BASE + 0x0c)
/** HRTIM_TIMA_CNTAR Timerx Counter Register **/
#define HRTIM_TIMA_CNTAR			MMIO32(HRTIM_TIMA_BASE + 0x10)
/** HRTIM_TIMA_PERAR Timerx Period Register **/
#define HRTIM_TIMA_PERAR			MMIO32(HRTIM_TIMA_BASE + 0x14)
/** HRTIM_TIMA_REPAR Timerx Repetition Register **/
#define HRTIM_TIMA_REPAR			MMIO32(HRTIM_TIMA_BASE + 0x18)
/** HRTIM_TIMA_CMP1AR Timerx Compare 1 Register **/
#define HRTIM_TIMA_CMP1AR			MMIO32(HRTIM_TIMA_BASE + 0x1c)
/** HRTIM_TIMA_CMP1CAR Timerx Compare 1 Compound Register **/
#define HRTIM_TIMA_CMP1CAR			MMIO32(HRTIM_TIMA_BASE + 0x20)
/** HRTIM_TIMA_CMP2AR Timerx Compare 2 Register **/
#define HRTIM_TIMA_CMP2AR			MMIO32(HRTIM_TIMA_BASE + 0x24)
/** HRTIM_TIMA_CMP3AR Timerx Compare 3 Register **/
#define HRTIM_TIMA_CMP3AR			MMIO32(HRTIM_TIMA_BASE + 0x28)
/** HRTIM_TIMA_CMP4AR Timerx Compare 4 Register **/
#define HRTIM_TIMA_CMP4AR			MMIO32(HRTIM_TIMA_BASE + 0x2c)
/** HRTIM_TIMA_CPT1AR Timerx Capture 1 Register **/
#define HRTIM_TIMA_CPT1AR			MMIO32(HRTIM_TIMA_BASE + 0x30)
/** HRTIM_TIMA_CPT2AR Timerx Capture 2 Register **/
#define HRTIM_TIMA_CPT2AR			MMIO32(HRTIM_TIMA_BASE + 0x34)
/** HRTIM_TIMA_DTAR Timerx Deadtime Register **/
#define HRTIM_TIMA_DTAR			MMIO32(HRTIM_TIMA_BASE + 0x38)
/** HRTIM_TIMA_SETA1R Timerx Output1 Set Register **/
#define HRTIM_TIMA_SETA1R			MMIO32(HRTIM_TIMA_BASE + 0x3c)
/** HRTIM_TIMA_RSTA1R Timerx Output1 Reset Register **/
#define HRTIM_TIMA_RSTA1R			MMIO32(HRTIM_TIMA_BASE + 0x40)
/** HRTIM_TIMA_SETA2R Timerx Output2 Set Register **/
#define HRTIM_TIMA_SETA2R			MMIO32(HRTIM_TIMA_BASE + 0x44)
/** HRTIM_TIMA_RSTA2R Timerx Output2 Reset Register **/
#define HRTIM_TIMA_RSTA2R			MMIO32(HRTIM_TIMA_BASE + 0x48)
/** HRTIM_TIMA_EEFAR1 Timerx External Event Filtering Register 1 **/
#define HRTIM_TIMA_EEFAR1			MMIO32(HRTIM_TIMA_BASE + 0x4c)
/** HRTIM_TIMA_EEFAR2 Timerx External Event Filtering Register 2 **/
#define HRTIM_TIMA_EEFAR2			MMIO32(HRTIM_TIMA_BASE + 0x50)
/** HRTIM_TIMA_RSTAR TimerA Reset Register **/
#define HRTIM_TIMA_RSTAR			MMIO32(HRTIM_TIMA_BASE + 0x54)
/** HRTIM_TIMA_CHPAR Timerx Chopper Register **/
#define HRTIM_TIMA_CHPAR			MMIO32(HRTIM_TIMA_BASE + 0x58)
/** HRTIM_TIMA_CPT1ACR Timerx Capture 2 Control Register **/
#define HRTIM_TIMA_CPT1ACR			MMIO32(HRTIM_TIMA_BASE + 0x5c)
/** HRTIM_TIMA_CPT2ACR CPT2xCR **/
#define HRTIM_TIMA_CPT2ACR			MMIO32(HRTIM_TIMA_BASE + 0x60)
/** HRTIM_TIMA_OUTAR Timerx Output Register **/
#define HRTIM_TIMA_OUTAR			MMIO32(HRTIM_TIMA_BASE + 0x64)
/** HRTIM_TIMA_FLTAR Timerx Fault Register **/
#define HRTIM_TIMA_FLTAR			MMIO32(HRTIM_TIMA_BASE + 0x68)

/**@}*/


/** @defgroup hrtim_tima_timacr TIMACR Timerx Control Register
@{*/


#define HRTIM_TIMA_TIMACR_UPDGAT_SHIFT		28
#define HRTIM_TIMA_TIMACR_UPDGAT_MASK		0x0f
/** @defgroup hrtim_tima_timacr_updgat UPDGAT Update Gating
@{*/
/**@}*/

/** HRTIM_TIMA_TIMACR_PREEN Preload enable **/
#define HRTIM_TIMA_TIMACR_PREEN		(1 << 27)

#define HRTIM_TIMA_TIMACR_DACSYNC_SHIFT		25
#define HRTIM_TIMA_TIMACR_DACSYNC_MASK		0x03
/** @defgroup hrtim_tima_timacr_dacsync DACSYNC AC Synchronization
@{*/
/**@}*/

/** HRTIM_TIMA_TIMACR_MSTU Master Timer update **/
#define HRTIM_TIMA_TIMACR_MSTU		(1 << 24)
/** HRTIM_TIMA_TIMACR_TEU TEU **/
#define HRTIM_TIMA_TIMACR_TEU		(1 << 23)
/** HRTIM_TIMA_TIMACR_TDU TDU **/
#define HRTIM_TIMA_TIMACR_TDU		(1 << 22)
/** HRTIM_TIMA_TIMACR_TCU TCU **/
#define HRTIM_TIMA_TIMACR_TCU		(1 << 21)
/** HRTIM_TIMA_TIMACR_TBU TBU **/
#define HRTIM_TIMA_TIMACR_TBU		(1 << 20)
/** HRTIM_TIMA_TIMACR_TxRSTU Timerx reset update **/
#define HRTIM_TIMA_TIMACR_TxRSTU		(1 << 18)
/** HRTIM_TIMA_TIMACR_TxREPU Timer x Repetition update **/
#define HRTIM_TIMA_TIMACR_TxREPU		(1 << 17)

#define HRTIM_TIMA_TIMACR_DELCMP4_SHIFT		14
#define HRTIM_TIMA_TIMACR_DELCMP4_MASK		0x03
/** @defgroup hrtim_tima_timacr_delcmp4 DELCMP4 Delayed CMP4 mode
@{*/
/**@}*/


#define HRTIM_TIMA_TIMACR_DELCMP2_SHIFT		12
#define HRTIM_TIMA_TIMACR_DELCMP2_MASK		0x03
/** @defgroup hrtim_tima_timacr_delcmp2 DELCMP2 Delayed CMP2 mode
@{*/
/**@}*/

/** HRTIM_TIMA_TIMACR_SYNCSTRTx Synchronization Starts Timer x **/
#define HRTIM_TIMA_TIMACR_SYNCSTRTx		(1 << 11)
/** HRTIM_TIMA_TIMACR_SYNCRSTx Synchronization Resets Timer x **/
#define HRTIM_TIMA_TIMACR_SYNCRSTx		(1 << 10)
/** HRTIM_TIMA_TIMACR_PSHPLL Push-Pull mode enable **/
#define HRTIM_TIMA_TIMACR_PSHPLL		(1 << 6)
/** HRTIM_TIMA_TIMACR_HALF Half mode enable **/
#define HRTIM_TIMA_TIMACR_HALF		(1 << 5)
/** HRTIM_TIMA_TIMACR_RETRIG Re-triggerable mode **/
#define HRTIM_TIMA_TIMACR_RETRIG		(1 << 4)
/** HRTIM_TIMA_TIMACR_CONT Continuous mode **/
#define HRTIM_TIMA_TIMACR_CONT		(1 << 3)

#define HRTIM_TIMA_TIMACR_CK_PSCx_SHIFT		0
#define HRTIM_TIMA_TIMACR_CK_PSCx_MASK		0x07
/** @defgroup hrtim_tima_timacr_ck_pscx CKPSCx HRTIM Timer x Clock prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_timaisr TIMAISR Timerx Interrupt Status Register
@{*/

/** HRTIM_TIMA_TIMAISR_O2CPY Output 2 Copy **/
#define HRTIM_TIMA_TIMAISR_O2CPY		(1 << 21)
/** HRTIM_TIMA_TIMAISR_O1CPY Output 1 Copy **/
#define HRTIM_TIMA_TIMAISR_O1CPY		(1 << 20)
/** HRTIM_TIMA_TIMAISR_O2STAT Output 2 State **/
#define HRTIM_TIMA_TIMAISR_O2STAT		(1 << 19)
/** HRTIM_TIMA_TIMAISR_O1STAT Output 1 State **/
#define HRTIM_TIMA_TIMAISR_O1STAT		(1 << 18)
/** HRTIM_TIMA_TIMAISR_IPPSTAT Idle Push Pull Status **/
#define HRTIM_TIMA_TIMAISR_IPPSTAT		(1 << 17)
/** HRTIM_TIMA_TIMAISR_CPPSTAT Current Push Pull Status **/
#define HRTIM_TIMA_TIMAISR_CPPSTAT		(1 << 16)
/** HRTIM_TIMA_TIMAISR_DLYPRT Delayed Protection Flag **/
#define HRTIM_TIMA_TIMAISR_DLYPRT		(1 << 14)
/** HRTIM_TIMA_TIMAISR_RST Reset Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_RST		(1 << 13)
/** HRTIM_TIMA_TIMAISR_RSTx2 Output 2 Reset Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_RSTx2		(1 << 12)
/** HRTIM_TIMA_TIMAISR_SETx2 Output 2 Set Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_SETx2		(1 << 11)
/** HRTIM_TIMA_TIMAISR_RSTx1 Output 1 Reset Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_RSTx1		(1 << 10)
/** HRTIM_TIMA_TIMAISR_SETx1 Output 1 Set Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_SETx1		(1 << 9)
/** HRTIM_TIMA_TIMAISR_CPT2 Capture2 Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_CPT2		(1 << 8)
/** HRTIM_TIMA_TIMAISR_CPT1 Capture1 Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_CPT1		(1 << 7)
/** HRTIM_TIMA_TIMAISR_UPD Update Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_UPD		(1 << 6)
/** HRTIM_TIMA_TIMAISR_REP Repetition Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_REP		(1 << 4)
/** HRTIM_TIMA_TIMAISR_CMP4 Compare 4 Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_CMP4		(1 << 3)
/** HRTIM_TIMA_TIMAISR_CMP3 Compare 3 Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_CMP3		(1 << 2)
/** HRTIM_TIMA_TIMAISR_CMP2 Compare 2 Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_CMP2		(1 << 1)
/** HRTIM_TIMA_TIMAISR_CMP1 Compare 1 Interrupt Flag **/
#define HRTIM_TIMA_TIMAISR_CMP1		(1 << 0)

/**@}*/

/** @defgroup hrtim_tima_timaicr TIMAICR Timerx Interrupt Clear Register
@{*/

