grevaillot/svd_tools/headers/STM32F3x4/hrtim_tima.h
/** HRTIM_TIMA_TIMAICR_DLYPRTC Delayed Protection Flag Clear **/
#define HRTIM_TIMA_TIMAICR_DLYPRTC		(1 << 14)
/** HRTIM_TIMA_TIMAICR_RSTC Reset Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_RSTC		(1 << 13)
/** HRTIM_TIMA_TIMAICR_RSTx2C Output 2 Reset flag Clear **/
#define HRTIM_TIMA_TIMAICR_RSTx2C		(1 << 12)
/** HRTIM_TIMA_TIMAICR_SET2xC Output 2 Set flag Clear **/
#define HRTIM_TIMA_TIMAICR_SET2xC		(1 << 11)
/** HRTIM_TIMA_TIMAICR_RSTx1C Output 1 Reset flag Clear **/
#define HRTIM_TIMA_TIMAICR_RSTx1C		(1 << 10)
/** HRTIM_TIMA_TIMAICR_SET1xC Output 1 Set flag Clear **/
#define HRTIM_TIMA_TIMAICR_SET1xC		(1 << 9)
/** HRTIM_TIMA_TIMAICR_CPT2C Capture2 Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_CPT2C		(1 << 8)
/** HRTIM_TIMA_TIMAICR_CPT1C Capture1 Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_CPT1C		(1 << 7)
/** HRTIM_TIMA_TIMAICR_UPDC Update Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_UPDC		(1 << 6)
/** HRTIM_TIMA_TIMAICR_REPC Repetition Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_REPC		(1 << 4)
/** HRTIM_TIMA_TIMAICR_CMP4C Compare 4 Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_CMP4C		(1 << 3)
/** HRTIM_TIMA_TIMAICR_CMP3C Compare 3 Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_CMP3C		(1 << 2)
/** HRTIM_TIMA_TIMAICR_CMP2C Compare 2 Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_CMP2C		(1 << 1)
/** HRTIM_TIMA_TIMAICR_CMP1C Compare 1 Interrupt flag Clear **/
#define HRTIM_TIMA_TIMAICR_CMP1C		(1 << 0)

/**@}*/

/** @defgroup hrtim_tima_timadier5 TIMADIER5 TIMxDIER5
@{*/

/** HRTIM_TIMA_TIMADIER5_DLYPRTDE DLYPRTDE **/
#define HRTIM_TIMA_TIMADIER5_DLYPRTDE		(1 << 30)
/** HRTIM_TIMA_TIMADIER5_RSTDE RSTDE **/
#define HRTIM_TIMA_TIMADIER5_RSTDE		(1 << 29)
/** HRTIM_TIMA_TIMADIER5_RSTx2DE RSTx2DE **/
#define HRTIM_TIMA_TIMADIER5_RSTx2DE		(1 << 28)
/** HRTIM_TIMA_TIMADIER5_SETx2DE SETx2DE **/
#define HRTIM_TIMA_TIMADIER5_SETx2DE		(1 << 27)
/** HRTIM_TIMA_TIMADIER5_RSTx1DE RSTx1DE **/
#define HRTIM_TIMA_TIMADIER5_RSTx1DE		(1 << 26)
/** HRTIM_TIMA_TIMADIER5_SET1xDE SET1xDE **/
#define HRTIM_TIMA_TIMADIER5_SET1xDE		(1 << 25)
/** HRTIM_TIMA_TIMADIER5_CPT2DE CPT2DE **/
#define HRTIM_TIMA_TIMADIER5_CPT2DE		(1 << 24)
/** HRTIM_TIMA_TIMADIER5_CPT1DE CPT1DE **/
#define HRTIM_TIMA_TIMADIER5_CPT1DE		(1 << 23)
/** HRTIM_TIMA_TIMADIER5_UPDDE UPDDE **/
#define HRTIM_TIMA_TIMADIER5_UPDDE		(1 << 22)
/** HRTIM_TIMA_TIMADIER5_REPDE REPDE **/
#define HRTIM_TIMA_TIMADIER5_REPDE		(1 << 20)
/** HRTIM_TIMA_TIMADIER5_CMP4DE CMP4DE **/
#define HRTIM_TIMA_TIMADIER5_CMP4DE		(1 << 19)
/** HRTIM_TIMA_TIMADIER5_CMP3DE CMP3DE **/
#define HRTIM_TIMA_TIMADIER5_CMP3DE		(1 << 18)
/** HRTIM_TIMA_TIMADIER5_CMP2DE CMP2DE **/
#define HRTIM_TIMA_TIMADIER5_CMP2DE		(1 << 17)
/** HRTIM_TIMA_TIMADIER5_CMP1DE CMP1DE **/
#define HRTIM_TIMA_TIMADIER5_CMP1DE		(1 << 16)
/** HRTIM_TIMA_TIMADIER5_DLYPRTIE DLYPRTIE **/
#define HRTIM_TIMA_TIMADIER5_DLYPRTIE		(1 << 14)
/** HRTIM_TIMA_TIMADIER5_RSTIE RSTIE **/
#define HRTIM_TIMA_TIMADIER5_RSTIE		(1 << 13)
/** HRTIM_TIMA_TIMADIER5_RSTx2IE RSTx2IE **/
#define HRTIM_TIMA_TIMADIER5_RSTx2IE		(1 << 12)
/** HRTIM_TIMA_TIMADIER5_SETx2IE SETx2IE **/
#define HRTIM_TIMA_TIMADIER5_SETx2IE		(1 << 11)
/** HRTIM_TIMA_TIMADIER5_RSTx1IE RSTx1IE **/
#define HRTIM_TIMA_TIMADIER5_RSTx1IE		(1 << 10)
/** HRTIM_TIMA_TIMADIER5_SET1xIE SET1xIE **/
#define HRTIM_TIMA_TIMADIER5_SET1xIE		(1 << 9)
/** HRTIM_TIMA_TIMADIER5_CPT2IE CPT2IE **/
#define HRTIM_TIMA_TIMADIER5_CPT2IE		(1 << 8)
/** HRTIM_TIMA_TIMADIER5_CPT1IE CPT1IE **/
#define HRTIM_TIMA_TIMADIER5_CPT1IE		(1 << 7)
/** HRTIM_TIMA_TIMADIER5_UPDIE UPDIE **/
#define HRTIM_TIMA_TIMADIER5_UPDIE		(1 << 6)
/** HRTIM_TIMA_TIMADIER5_REPIE REPIE **/
#define HRTIM_TIMA_TIMADIER5_REPIE		(1 << 4)
/** HRTIM_TIMA_TIMADIER5_CMP4IE CMP4IE **/
#define HRTIM_TIMA_TIMADIER5_CMP4IE		(1 << 3)
/** HRTIM_TIMA_TIMADIER5_CMP3IE CMP3IE **/
#define HRTIM_TIMA_TIMADIER5_CMP3IE		(1 << 2)
/** HRTIM_TIMA_TIMADIER5_CMP2IE CMP2IE **/
#define HRTIM_TIMA_TIMADIER5_CMP2IE		(1 << 1)
/** HRTIM_TIMA_TIMADIER5_CMP1IE CMP1IE **/
#define HRTIM_TIMA_TIMADIER5_CMP1IE		(1 << 0)

/**@}*/

/** @defgroup hrtim_tima_cntar CNTAR Timerx Counter Register
@{*/


#define HRTIM_TIMA_CNTAR_CNTx_SHIFT		0
#define HRTIM_TIMA_CNTAR_CNTx_MASK		0xffff
/** @defgroup hrtim_tima_cntar_cntx CNTx Timerx Counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_perar PERAR Timerx Period Register
@{*/


#define HRTIM_TIMA_PERAR_PERx_SHIFT		0
#define HRTIM_TIMA_PERAR_PERx_MASK		0xffff
/** @defgroup hrtim_tima_perar_perx PERx Timerx Period value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_repar REPAR Timerx Repetition Register
@{*/


#define HRTIM_TIMA_REPAR_REPx_SHIFT		0
#define HRTIM_TIMA_REPAR_REPx_MASK		0xff
/** @defgroup hrtim_tima_repar_repx REPx Timerx Repetition counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_cmp1ar CMP1AR Timerx Compare 1 Register
@{*/


#define HRTIM_TIMA_CMP1AR_CMP1x_SHIFT		0
#define HRTIM_TIMA_CMP1AR_CMP1x_MASK		0xffff
/** @defgroup hrtim_tima_cmp1ar_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_cmp1car CMP1CAR Timerx Compare 1 Compound Register
@{*/


#define HRTIM_TIMA_CMP1CAR_REPx_SHIFT		16
#define HRTIM_TIMA_CMP1CAR_REPx_MASK		0xff
/** @defgroup hrtim_tima_cmp1car_repx REPx Timerx Repetition value (aliased from HRTIM_REPx register)
@{*/
/**@}*/


#define HRTIM_TIMA_CMP1CAR_CMP1x_SHIFT		0
#define HRTIM_TIMA_CMP1CAR_CMP1x_MASK		0xffff
/** @defgroup hrtim_tima_cmp1car_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_cmp2ar CMP2AR Timerx Compare 2 Register
@{*/


#define HRTIM_TIMA_CMP2AR_CMP2x_SHIFT		0
#define HRTIM_TIMA_CMP2AR_CMP2x_MASK		0xffff
/** @defgroup hrtim_tima_cmp2ar_cmp2x CMP2x Timerx Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_cmp3ar CMP3AR Timerx Compare 3 Register
@{*/


#define HRTIM_TIMA_CMP3AR_CMP3x_SHIFT		0
#define HRTIM_TIMA_CMP3AR_CMP3x_MASK		0xffff
/** @defgroup hrtim_tima_cmp3ar_cmp3x CMP3x Timerx Compare 3 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_cmp4ar CMP4AR Timerx Compare 4 Register
@{*/


#define HRTIM_TIMA_CMP4AR_CMP4x_SHIFT		0
#define HRTIM_TIMA_CMP4AR_CMP4x_MASK		0xffff
/** @defgroup hrtim_tima_cmp4ar_cmp4x CMP4x Timerx Compare 4 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_tima_cpt1ar CPT1AR Timerx Capture 1 Register
@{*/


#define HRTIM_TIMA_CPT1AR_CPT1x_SHIFT		0
#define HRTIM_TIMA_CPT1AR_CPT1x_MASK		0xffff
/** @defgroup hrtim_tima_cpt1ar_cpt1x CPT1x Timerx Capture 1 value
@{*/
/**@}*/


/**@}*/

